DataProcessors/упРМПланированиеРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМПланированиеРейсов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/упЗаданиеНаПеревозкуГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗаданиеНаПеревозкуГруза</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упЗаявкиКВыполнению</xr:Item>
				<xr:Item>AccumulationRegister.упСостояниеПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упПланПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаданийНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упПараметрыЗаданияНаПеревозку</xr:Item>
				<xr:Item>AccumulationRegister.упЗаданияКПланированию</xr:Item>
				<xr:Item>InformationRegister.упПараметрыЗаявкиНаПеревозку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспортныхУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПогрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРазгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыАдресаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыАдресаПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКИС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноИсполнениеНесколькимиРейсами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГрузов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВЦепиПоставок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВЦепиПоставокКонец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийГруз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлениеГрузаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлениеГрузаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучениеГрузаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучениеГрузаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПриоритетыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИнкассацииПлан</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрузовыеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГрузов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяОперация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/упРМПланированиеРейсов/Forms/ФормаНазначенияПеревозокТранспортнойКомпании/Ext/Form/Module.bsl
#Область ПеременныеМодуляФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мсвСтруктурЗаданий = Параметры.МассивСтруктурЗаданий;
	РазбиватьЗаданияПоГрузовымМестам = Параметры.РазбиватьЗаданияПоГрузовымМестам;
	Сч = 0;
	Для каждого текСтруктура Из мсвСтруктурЗаданий Цикл
		НоваяСтрока = СписокНазначений.Добавить();
		Сч = Сч + 1;
		НоваяСтрока.НомерСтроки = Сч;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, текСтруктура);
	КонецЦикла; 
	Элементы.СписокНазначенийГрузовоеМесто.Видимость = РазбиватьЗаданияПоГрузовымМестам;
	Элементы.СписокНазначенийКоличествоГрузов.Видимость = РазбиватьЗаданияПоГрузовымМестам;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Закрыть(НазначенныеЗадания);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокНазначенийПеревозчикПриИзменении(Элемент)
	
	текСтрока = Элементы.СписокНазначений.ТекущиеДанные;
	ОбработатьИзменениеДанныхСтроки(текСтрока);
	ОбработатьВыделенныеСтроки("Перевозчик", текСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНазначенийСоглашениеПриИзменении(Элемент)
	
	текСтрока = Элементы.СписокНазначений.ТекущиеДанные;
	ОбработатьИзменениеДанныхСтроки(текСтрока);
	ОбработатьВыделенныеСтроки("Соглашение", текСтрока);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура РаспределитьЗадания(Команда)
	
	Отказ = Ложь;
	Ошибки = Неопределено;
	ПроверитьЗаполнениеВыбранныхСтрок(Ошибки);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	Если Не Отказ Тогда
		РаспределитьЗаданияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСпискуНазначений(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница1;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтроки(Строка)

	Если Строка <> Неопределено Тогда
		Если ЗначениеЗаполнено(Строка.Перевозчик) И ЗначениеЗаполнено(Строка.Соглашение) Тогда
			Строка.Пометка = Истина;
		Иначе
			Строка.Пометка = Ложь;
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры // ОбработатьИзменениеДанныхСтроки()	

&НаКлиенте
Процедура ОбработатьВыделенныеСтроки(ИмяЭлемента, Строка);
	
	ВыделенныеСтроки = Элементы.СписокНазначений.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			ИскомаяСтрока = СписокНазначений.НайтиПоИдентификатору(ИдентификаторСтроки);
			Если ИскомаяСтрока <> Неопределено И ИскомаяСтрока <> Строка Тогда
				ИскомаяСтрока[ИмяЭлемента] = Строка[ИмяЭлемента];
				ОбработатьИзменениеДанныхСтроки(ИскомаяСтрока);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры // ОбработатьВыделенныеСтроки()

&НаКлиенте
Процедура ПроверитьЗаполнениеВыбранныхСтрок(Ошибки)
	
	ЕстьПомеченныеСтроки = Ложь;
	Для каждого текСтрока Из СписокНазначений Цикл
		Если текСтрока.Пометка Тогда
			Если Не ЗначениеЗаполнено(текСтрока.Перевозчик) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "СписокНазначений[%1].Перевозчик", НСтр("ru = 'Перевозчик в строке не выбран.'"),"СписокНазначений.Перевозчик", текСтрока.НомерСтроки - 1, НСтр("ru = 'Перевозчик в строке %1 не выбран.'"), текСтрока.НомерСтроки - 1);
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(текСтрока.Соглашение) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "СписокНазначений[%1].Соглашение", НСтр("ru = 'Соглашение в строке не выбрано.'"),"СписокНазначений.Соглашение", текСтрока.НомерСтроки - 1, НСтр("ru = 'Соглашение в строке %1 не выбрано.'"), текСтрока.НомерСтроки - 1);
			КонецЕсли;	
			ЕстьПомеченныеСтроки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьПомеченныеСтроки Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "СписокНазначений", НСтр("ru = 'Не выбрано ни одной строки!'"), "",,,);
	КонецЕсли;
		
КонецПроцедуры // ПроверитьЗаполнениеВыбранныхСтрок()

&НаСервере
Процедура РаспределитьЗаданияНаСервере()
	
	тзНазначения = СписокНазначений.Выгрузить(Новый Структура("Пометка", Истина));
	ТекстОшибки = "";
	Отказ = Ложь;
	
	Если РазбиватьЗаданияПоГрузовымМестам Тогда
		тзЗадания = тзНазначения.Скопировать(, "ЗаданиеНаПеревозку, Перевозчик, Соглашение");
		тзЗадания.Свернуть("ЗаданиеНаПеревозку, Перевозчик, Соглашение");
		сткПоиска = Новый Структура("ЗаданиеНаПеревозку, Перевозчик, Соглашение");
		Для каждого текЗадание Из тзЗадания Цикл
			Попытка
				ЗаблокироватьДанныеДляРедактирования(текЗадание.ЗаданиеНаПеревозку,, УникальныйИдентификатор);
			Исключение
				ТекстОшибки = НСтр("ru='Не удалось заблокировать %Элемент%. %ОписаниеОшибки%'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Элемент%",        текЗадание.ЗаданиеНаПеревозку);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецПопытки;
			ЗаполнитьЗначенияСвойств(сткПоиска, текЗадание);
			тзЗадания = тзНазначения.Скопировать(сткПоиска, "ЗаданиеНаПеревозку, ГрузовоеМесто, КоличествоГрузов");
			
			СформироватьРейсы(текЗадание, тзЗадания, ТекстОшибки, Отказ);
		КонецЦикла; 
	Иначе
		Для каждого текЗадание Из тзНазначения Цикл
			Попытка
				ЗаблокироватьДанныеДляРедактирования(текЗадание.ЗаданиеНаПеревозку,, УникальныйИдентификатор);
			Исключение
				ТекстОшибки = НСтр("ru='Не удалось заблокировать %Элемент%. %ОписаниеОшибки%'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Элемент%",        текЗадание.ЗаданиеНаПеревозку);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецПопытки;
			
			СформироватьРейсы(текЗадание, Неопределено, ТекстОшибки, Отказ);
		КонецЦикла; 
	КонецЕсли; 
	
	Если СписокНазначений.Количество() = 0 Тогда
		Элементы.ВернутьсяКСпискуНазначений.Доступность = Ложь;
	КонецЕсли; 
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница2;
	
КонецПроцедуры // РаспределитьЗаданияНаСервере()

&НаСервере
Процедура СформироватьРейсы(СтрокаЗадание, ТаблицаЗаданий, ТекстОшибки, Отказ);
	
	ДополнительныеРеквизиты = Новый Структура;
	сткДанныеТС = Новый Структура("Перевозчик, Соглашение");
	сткДанныеТС.Вставить("ПеревозкаТранспортнойКомпанией", Истина);
	ЗаполнитьЗначенияСвойств(сткДанныеТС, СтрокаЗадание);
	сткДанныеТС.Вставить("Автор",ПользователиКлиентСервер.ТекущийПользователь());
	
	Если ТаблицаЗаданий = Неопределено Тогда
		мсвРейсов = Документы.упЗаданиеНаПеревозкуГруза.СформироватьРейсы(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаЗадание.ЗаданиеНаПеревозку), Неопределено, сткДанныеТС, Неопределено, ТекстОшибки, Отказ);
	Иначе	
		ТаблицаЗаданий.Свернуть("ЗаданиеНаПеревозку, ГрузовоеМесто", "КоличествоГрузов");
		мсвРейсов = Документы.упЗаданиеНаПеревозкуГруза.СформироватьРейсы(Неопределено, ТаблицаЗаданий, сткДанныеТС, Неопределено, ТекстОшибки, Отказ);
	КонецЕсли; 
	РазблокироватьДанныеДляРедактирования(СтрокаЗадание.ЗаданиеНаПеревозку, УникальныйИдентификатор);
	Если Отказ Тогда
		ЗаписьЖурналаРегистрации("Создание рейса", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	Иначе	
		Для каждого текРейс Из мсвРейсов Цикл
			НоваяСтрока = СозданныеДокументы.Добавить();
			НоваяСтрока.Рейс = текРейс;
		КонецЦикла;
		НазначенныеЗадания.Добавить(СтрокаЗадание.ЗаданиеНаПеревозку);
		ИскомыеСтроки = СписокНазначений.НайтиСтроки(Новый Структура("ЗаданиеНаПеревозку", СтрокаЗадание.ЗаданиеНаПеревозку));
		Для каждого текСтрока Из ИскомыеСтроки Цикл
			СписокНазначений.Удалить(текСтрока);
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры // СформироватьРейсы()
	
#КонецОбласти
